app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)
	@project.user_id = current_user.id
    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("created_at", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Sat, 07 Dec 2013 10:39:37 UTC +00:00], ["name", "Proiect nou"], ["updated_at", Sat, 07 Dec 2013 10:39:37 UTC +00:00], ["user_id", 1]]