app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]
---
  def index
    @tasks = current_user.tasks
    @tasks = Task.where(:user_id => current_user.id)

INSERT INTO "tasks" ("created_at", "deadline", "description", "name", "project_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @task 	  = Task.new(task_params)
    @task.user_id = current_user.id
    @task.project_id = params[:task][:project_id]

    respond_to do |format|
      if @task.save